In [89]:
import pandas as pd
import numpy as np

In [90]:
df=pd.read_csv('titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [91]:
updated=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')
updated.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [92]:
target=df['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [93]:
from sklearn.preprocessing import LabelEncoder
le_Sex=LabelEncoder()

In [94]:
updated['sex_n']=le_Sex.fit_transform(updated['Sex'])
updated.head()

   Survived  Pclass     Sex   Age     Fare  sex_n
0         0       3    male  22.0   7.2500      1
1         1       1  female  38.0  71.2833      0
2         1       3  female  26.0   7.9250      0
3         1       1  female  35.0  53.1000      0
4         0       3    male  35.0   8.0500      1

In [95]:
import math
updated['Age']=updated['Age'].fillna(updated['Age'].mean())
updated.head()

   Survived  Pclass     Sex   Age     Fare  sex_n
0         0       3    male  22.0   7.2500      1
1         1       1  female  38.0  71.2833      0
2         1       3  female  26.0   7.9250      0
3         1       1  female  35.0  53.1000      0
4         0       3    male  35.0   8.0500      1

In [96]:
Recent_updated=updated.drop(['Sex'],axis='columns')
Recent_updated.head()

   Survived  Pclass   Age     Fare  sex_n
0         0       3  22.0   7.2500      1
1         1       1  38.0  71.2833      0
2         1       3  26.0   7.9250      0
3         1       1  35.0  53.1000      0
4         0       3  35.0   8.0500      1

In [97]:
Recent_updated=Recent_updated.Age
Recent_updated

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [156]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(Recent_updated,target,test_size=0.08)

In [157]:
len(x_train)

819

In [158]:
len(x_test)

72

In [159]:
from sklearn import tree
#model=tree.DecisionTreeClassifier()

In [160]:
model=tree.DecisionTreeClassifier()
#model.fit(x.reshape(-1,1),y)
model.fit([x_train], [y_train])
#model.reshape(-1,1)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [161]:
model.score([x_train],[y_train])

1.0